glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
    usart->p_info->xfer.send_active           = 0U;
    usart->p_info->xfer.tx_def_val            = 0U;

// Configure CTS pin
    if(usart->capabilities.cts) {
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin,
                     ARM_GPIO_IO_MODE_INPUT, ARM_GPIO_IO_TYPE_OPEN_DRAIN , ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[CTS_PIN].alt_func);
    }
// Configure RTS pin
    if(usart->capabilities.rts) {
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin,
                     ARM_GPIO_IO_MODE_OUTPUT, ARM_GPIO_IO_TYPE_PUSH_PULL, ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[RTS_PIN].alt_func);
    }
// DMA Initialize
    //unsupported in Version 1.0
    usart->p_info->flags = ARM_USART_FLAG_INITIALIZED;
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Uninitialize(ARM_USART_RESOURCES *usart)
{
// Reset TX pin configuration
    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Reset RX pin configuration
    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Unconfigure CTS pin
    if(usart->capabilities.cts) {
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }
// Unconfigure RTS pin
    if(usart->capabilities.rts) {
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }
// DMA Uninitialize function
    //unsupported in Version 1.0

// Reset USART status flags
    usart->p_info->flags = 0UL;
    return ARM_DRIVER_OK;
}

/***********************************************************************************
To stop working with a peripheral the functions PowerControl and Uninitialize need
to be called in this order:
drv->PowerControl (ARM_POWER_OFF);     // Terminate any pending transfers, reset IRQ/DMA, power off peripheral
drv->Uninitialize (...);               // Release I/O pins
************************************************************************************/

static int32_t ARM_USART_PowerControl(ARM_POWER_STATE  state,
                                      ARM_USART_RESOURCES *usart)
{
    switch(state) {
        case ARM_POWER_OFF: {
            // Disable USART IRQ
            NVIC_DisableIRQ(usart->irq_num);

            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
            // Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
            // Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);
            // Disable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, DISABLE_CMD);
            // Clear pending USART interrupts in NVIC
            NVIC_ClearPendingIRQ(usart->irq_num);

            // Clear driver flag variables
            usart->p_info->rx_status.rx_busy          = 0U;
            usart->p_info->rx_status.rx_overflow      = 0U;
            usart->p_info->rx_status.rx_break         = 0U;
            usart->p_info->rx_status.rx_framing_error = 0U;
            usart->p_info->rx_status.rx_parity_error  = 0U;
            usart->p_info->xfer.send_active           = 0U;

            usart->p_info->flags &= ~ARM_USART_FLAG_POWERED;
            break;
        }
        case ARM_POWER_LOW: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
        case ARM_POWER_FULL: {
            if((usart->p_info->flags & ARM_USART_FLAG_INITIALIZED) == 0U) {
                return ARM_DRIVER_ERROR;
            }
            if((usart->p_info->flags & ARM_USART_FLAG_POWERED)     != 0U) {
                return ARM_DRIVER_OK;
            }

            // Enable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
            // Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
            // Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);
            // Disable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, DISABLE_CMD);

            // Clear driver variables
            usart->p_info->rx_status.rx_busy          = 0U;
            usart->p_info->rx_status.rx_overflow      = 0U;
            usart->p_info->rx_status.rx_break         = 0U;
            usart->p_info->rx_status.rx_framing_error = 0U;
            usart->p_info->rx_status.rx_parity_error  = 0U;

            usart->p_info->xfer.send_active           = 0U;

            usart->p_info->mode                       = 0U;
            usart->p_info->flags                      = 0U;
            usart->p_info->baudrate                   = 0U;//я добавила

            usart->p_info->flags = ARM_USART_FLAG_POWERED | ARM_USART_FLAG_INITIALIZED;

            // Clear and Enable USART IRQ
            NVIC_ClearPendingIRQ(usart->irq_num);
            NVIC_EnableIRQ(usart->irq_num);
            break;
        }
        default: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
    }
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Send(const void *data, uint32_t num,
                              ARM_USART_RESOURCES *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Receive(void *data, uint32_t num,
                                 ARM_USART_RESOURCES *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_Transfer(const void *data_out, void *data_in,
                                  uint32_t num, ARM_USART_RESOURCES *usart)
{
//to do
    return ARM_DRIVER_OK;
}

static uint32_t ARM_USART_GetTxCount(ARM_USART_RESOURCES *usart)
{
    uint32_t cnt;
// to do
    return cnt;
}

static uint32_t ARM_USART_GetRxCount(ARM_USART_RESOURCES *usart)

{
    uint32_t cnt;
// to do
    return cnt;
}

static int32_t ARM_USART_Control(uint32_t control, uint32_t arg,
                                 ARM_USART_RESOURCES *usart)
{
    if((usart->p_info->flags & ARM_USART_FLAG_POWERED) == 0U) {
        // USART not powered
        return ARM_DRIVER_ERROR;
    }
    switch(control & ARM_USART_CONTROL_Msk) {
        // Control TX
        case  ARM_USART_CONTROL_TX: {
            //Check if pin configure available
            if(usart->p_pin == NULL) {
                return ARM_DRIVER_ERROR;
            }
            if(arg) {
                if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                    // USART TX pin function selected
                    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                 ARM_GPIO_IO_MODE_INPUT, ARM_GPIO_IO_TYPE_OPEN_DRAIN , ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                 usart-> p_pin[TX_PIN].alt_func);
                    usart->p_reg->CR1 |= USART_CR1_TE;
                    usart->p_info->flags |= ARM_USART_FLAG_TX_ENABLED;
                }
            } else {
                usart->p_reg->CR1 &= ~USART_CR1_TE;
                if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                    // SPIO default pin function selected
                    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                 0U, 0U, 0U, 0U, 0U);
                }
                usart->p_info->flags &= ~ARM_USART_FLAG_TX_ENABLED;

