glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
static ARM_USART_STATUS ARM_USART1_GetStatus(void)
{
    return ARM_USART_GetStatus(&ARM_USART1_Resources);
}
static int32_t ARM_USART1_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return ARM_USART_SetModemControl(control, &ARM_USART1_Resources);
}
static ARM_USART_MODEM_STATUS ARM_USART1_GetModemStatus(void)
{
    return ARM_USART_GetModemStatus(&ARM_USART1_Resources);
}

void UART1_IRQHandler(void)
{
    USART_IRQHandler(&ARM_USART1_Resources);
};

//********************************************************************************
//Variables (continuation)
//********************************************************************************

static ARM_DRIVER_USART ARM_USART1_Driver = {
    ARM_USARTx_GetVersion,
    ARM_USART1_GetCapabilities,
    ARM_USART1_Initialize,
    ARM_USART1_Uninitialize,
    ARM_USART1_PowerControl,
    ARM_USART1_Send,
    ARM_USART1_Receive,
    ARM_USART1_Transfer,
    ARM_USART1_GetTxCount,
    ARM_USART1_GetRxCount,
    ARM_USART1_Control,
    ARM_USART1_GetStatus,
    ARM_USART1_SetModemControl,
    ARM_USART1_GetModemStatus

};
#endif //(RTE_USART1==1)

/*************************************************
Driver capabilities of UART5 are completely
similar to UART4 driver capabilities.
***************************************************/
#if (RTE_UART4==1)

static void ARM_USART4_Resources_Struct_Init(void)
{
    ARM_USART_RESOURCES *p_str = &ARM_USART4_Resources;
    ARM_USART1_Resources.capabilities.asynchronous = 1;// supports UART (Asynchronous) mode
    p_str->capabilities.synchronous_master = 0;         // supports Synchronous Master mode
    p_str->capabilities.synchronous_slave = 0;          // supports Synchronous Slave mode
    p_str->capabilities.single_wire = 1;                // supports UART Single-wire mode
    p_str->capabilities.irda = 1;                       // supports UART IrDA mode
    p_str->capabilities.smart_card =  0;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  0;          // Smart Card Clock generator available
    p_str->capabilities.flow_control_rts =  0;          // RTS Flow Control available
    p_str->capabilities.flow_control_cts =  0;          // CTS Flow Control available
    p_str->capabilities.event_tx_complete =  1;         // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    p_str->capabilities.event_rx_timeout =  0;          // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    p_str->capabilities.rts =  0;                       // RTS Line: 0=not available, 1=available
    p_str->capabilities.cts =  0;                       // CTS Line: 0=not available, 1=available
    p_str->capabilities.dtr =  0;                       // DTR Line: 0=not available, 1=available
    p_str->capabilities.dsr =  0;                       // DSR Line: 0=not available, 1=available
    p_str->capabilities.dcd =  0;                       // DCD Line: 0=not available, 1=available
    p_str->capabilities.ri =  0;                        // RI Line: 0=not available, 1=available
    p_str->capabilities.event_cts =  0;                 // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    p_str->capabilities.event_dsr =  0;                 // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    p_str->capabilities.event_dcd =  0;                 // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    p_str->capabilities.event_ri =  0;                  // Signal RI change event: \ref ARM_USART_EVENT_RI
    p_str->capabilities.reserved =  0;                  // Reserved (must be zero)
    p_str->usart_name = UART_4;                        //Interface name
    p_str->p_reg = UART4;                              // Pointer to USART peripheral registers
    p_str->p_pin = USART_GetPinCfg(UART_4);         // Pointer to USART pins configuration
    p_str->irq_num = UART4_IRQn;
    p_str->p_info = &UART4_Info;
}
#endif //(RTE_UART4==1)

//================================================================================
//Public
//================================================================================

void ARM_USART_Init(void)
{

#if (RTE_USART1==1)

    ARM_DRIVER_USART *p_drv = &ARM_USART1_Driver;
    ARM_USART1_Resources_Struct_Init();
    p_drv->Initialize(&USART1_cb);
    p_drv->PowerControl(ARM_POWER_FULL);
#endif//(RTE_USART1==1)

}
